In [1]:
import sqlite3
import pandas as pd

In [ ]:
fastfood = pd.read_excel('fastfood.xlsx')
fastfood.tail

In [5]:
conn = sqlite3.connect('teste.db')

In [6]:
fastfood.to_sql('fastfood', conn, if_exists='replace', index = False)

515

In [12]:
query = 'select item, calories from fastfood where calories > 500'
df = pd.read_sql(query, conn)

In [14]:
df

                                          item  calories
0               Single Bacon Smokehouse Burger       840
1               Double Bacon Smokehouse Burger      1130
2    Grilled Bacon Smokehouse Chicken Sandwich       750
3     Crispy Bacon Smokehouse Chicken Sandwich       920
4                                      Big Mac       540
..                                         ...       ...
241             Spicy Triple Double Crunchwrap       780
242                Express Taco Salad w/ Chips       580
243                     Fiesta Taco Salad-Beef       780
244                  Fiesta Taco Salad-Chicken       720
245                    Fiesta Taco Salad-Steak       720

[246 rows x 2 columns]

In [15]:
conn.close()

In [16]:
conn = sqlite3.connect('coderhouse.db')

In [19]:
query = "SELECT name FROM sqlite_master WHERE type='table'"
schema = pd.read_sql_query(query, conn)

In [20]:
conn.close()

In [31]:
def tabelas_db():
    conn = sqlite3.connect('coderhouse.db')
    query = "SELECT name FROM sqlite_master WHERE type='table'"
    schema = pd.read_sql_query(query, conn)
    conn.close()
    return schema

In [32]:
tabelas_db()

       name
0  produtos
1  fastfood
2      fast

In [33]:
def salva_db(df, nome_tabela):
    conn = sqlite3.connect('coderhouse.db')
    df.to_sql(nome_tabela, conn, if_exists='replace', index = False)

    conn.close()
    return schema

In [34]:
salva_db(fastfood, 'fast')

       name
0  produtos
1  fastfood

In [ ]:
def carrega_db(nome_tabela):
    conn = sqlite3.connect('coderhouse.db')
    
    
    conn.close()
    return schema